-- =====================================================
-- MIGRAÇÃO DE MANUTENÇÃO
-- Data: 2025-09-24
-- Autor: Luis Augusto
-- =====================================================

-- *****************************************************************************************
-- ************** É OBRIGATÓRIO INCLUIR O REGISTRO NA TABELA VERSAO_BASE_DADO **************
-- *****************************************************************************************

INSERT INTO VERSAO_BASE_DADO (VRBD_DATA, VRBD_VERSAO_BASE_DADO, VRBD_DESCRICAO) VALUES
(
    datetime('now'),
    'v0008',
    'Correção de chaves estrangeiras na tabela NBS_APLICAVEL.'
);

-- -----------------------------------------------------------------------------------------------
-- Descrição:
-- 1 - Correção de chaves estrangeiras na tabela NBS_APLICAVEL.
-- 2 - ...
-- -----------------------------------------------------------------------------------------------

-- -----------------------------------------------------------------------------------------------
-- Início da migração
-- -----------------------------------------------------------------------------------------------

UPDATE NBS_APLICAVEL SET NBSA_ANXO_ID = NULL WHERE NBSA_ANXO_ID >= 822;
